supersonicCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       100075;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       100175;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          500;
        startFace       100275;
    }
    cylinderWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          79;
        startFace       100775;
    }
    symmetryPlane
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          480;
        startFace       100854;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100718;
        startFace       101334;
    }
)

// ************************************************************************* //
